Tekla Open API Reference for Tekla Structures 2025
IntList.GetRange Method
 Gets a sub-list of the integer list.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public IntList GetRange(
	int index,
	int count
)
Public Function GetRange (
	index As Integer,
	count As Integer
) As IntList
Parameters
index
Type: System.Int32
The start index of the new list.
count
Type: System.Int32
The number of items in the new list.
Return Value
Type: IntList
The new integer list.
See Also
Reference
IntList Class
Tekla.Structures.Drawing Namespace